{"type":"PR","pr":{"number":350,"head":"d65f2b1190c6cb07da39b25c3817bf01236ac43b"},"user":"chris.rodgers","status":"draft","branch":"cms/account-executive","collection":"job","title":"Account Executive","description":"# About us\n\nWe’ve got a great new opportunity for an Account Executive to join our team!\n\nRLA are a hugely successful full service creative agency, with offices in Bournemouth, Belfast and London. From the moment we opened our doors 30 years ago, we’ve been helping an enviable roster of clients achieve their goals; ranging from start-ups to some of the world’s most famous brands! Furthermore, we are part of the Mission group, the fifth largest communications group in the UK.\n\nWe look for people who share and can demonstrate our core values; Agile, Astute, Can-Do, Inspiring, Trusted, Together. In return, we can offer you a great place to work in an environment that encourages continuous self-improvement and development. What’s more, you’ll have the best of both worlds as you’ll be based in a beautiful, relaxed countryside location, but be just a 20-minute drive to the beach!\n\n# The Role\n\nYou will be working as part of a brilliant and experienced team providing support to the Senior Account Managers and Account Managers on the agency’s biggest account! This role would suit someone with amazing organisation and administrative skills and an excellent eye for detail. \nThe role will involve day to day duties of maintaining the account and reporting to a Senior Account Manager. \nYou will:\n\nBe responsible for maintaining the client’s Marketing Helpline.\n\nEnsure that any queries are dealt with in a timely and efficient manner.\n\nAssist with the trafficking of projects through the production process from briefing creative work through to the completed product.\n\nBe responsible for managing the production process to ensure we meet project deadlines through proactive management.\n\nResponsible for managing allocated small projects from start to finish and deliver to time, cost and quality.\n\nProvide an effective timely and professional service to the Client either directly or via Account Manager.\n\nDevelop relationships with colleagues across the group and always support in a professional manner.\n\nCompile status reports and contact reports.\n\n# About You\n\nMarketing or business-related degree would be highly desirable as would previous digital experience and/or knowledge.\n\nExcellent organizational and administrative skills.\n\nExcellent communication skills.\n\nSelf-motivated.\n\nAbility to work flexibly, on own initiative and as part of a team.\n\nFirst class ability to prioritise and manage own workload.\n\nDrive for personal growth.","objects":{"entry":{"path":"src/pages/careers/account-executive.md","sha":"90ab7e7653bde4af217939fe8ef611bcfba5d41f"},"files":[]},"timeStamp":"2018-05-30T12:44:15.550Z"}