{"type":"PR","pr":{"number":498,"head":"6a0826f6593520d88901284f204f4098de9de4cd"},"user":"chris.rodgers","status":"pending_publish","branch":"cms/client-services-director-bournemouth","collection":"job","title":"Client Services Director, Bournemouth.","description":"**About Us**\\\nWith a 30 year pedigree, RLA is a full-service advertising and marketing communications agency, focusing today on maximising the opportunity our digital technology platform – Cortex- brings in utilising client data across their multiple business areas to maximise communications impact.  We pride ourselves in being insightful, original thinkers with very high standards across all agency disciplines including Creative, Design and Client Services.\n\nWholly owned by the UK’s largest communications group outside of London, the Mission Marketing Group PLC, we are part of a very large and constantly growing business with big aspirations. Enjoying a turnover in excess of £125m ‘the Mission’ has 16 agencies, employing over 1000 staff across 25 offices in the UK, Singapore, Shanghai, Hong Kong, Malaysia, Vietnam and San Francisco. \n\nAs a result, RLA enjoy access to the UK’s largest community of expert communications talent at a scale normally reserved for agencies four times our size. It’s a hugely exciting time to join us and not only that, our location means you’ll have the best of both worlds as you’ll be based in a beautiful, relaxed countryside location, but be just a 20-minute drive to the gorgeous beaches of the South West!\n\n**The Role**\\\nThis is a Board level role and will have a direct reporting line to the Managing Director and is accountable for overall strategic management and growth of all retained or project accounts. You’ll be responsible for leading the retained or project team to meet key operational deliverables of the department which include; managing the operational budget, leading the professional development and continuous improvement of the department. \n\nYou will:  \n\n* Drive long term client planning and growth.\n* Actively work with 1st line reports to drive client activity, initiating strategic and tactical solutions that are commercially creative for both clients and the Agency.\n* Be instrumental and manage pitches from a Client Services perspective with both new and existing clients.\n* Act as key point of contact for the Managing Director for Agency retained business/project team and to be responsible for issuing both financial and people related reports to the Managing Director.\n* Ensure that the company people processes are effectively deployed and managed across the department i.e. one to ones/appraisals, inductions, training requirements and recruitment and performance management, ensuring that team members are aware of, and adhere to agency procedures and best practice.\n* Work with the Managing Director on establishing key operational strategies both financially and people related.\n* Ensure contracts are negotiated and in place for existing and new clients.\n* Review market developments and industry trends and identify potential opportunities for RLA.\n* Have ownership of overall targets within client services.\n\n**About you**  \n\n* Experience of managing and developing a high performing team, an attentive listener and motivator of teams.\n* Excellent communicator (at all levels), presenting with exceptional gravitas.\n* Highly commercial (strong sales drive), with proven track record of setting and exceeding stretching growth targets and identifying and landing new business.\n* A relentless desire for developing a team who can deliver work on budget, on brief and on time.\n* Proactively manages the manpower planning within the department identify future resource requirements.\n* A forensic attention to detail and the ability to implement process to maintain quality control and profitability across all accounts.\n* Genuine insight into B2B marketing, experience working with automotive companies would be an advantage.","objects":{"entry":{"path":"src/pages/careers/client-services-director-bournemouth.md","sha":"f6ef740f5867024f64a85c7a6ad1f25d59eca640"},"files":[]},"timeStamp":"2018-10-03T14:09:29.290Z"}