{"type":"PR","pr":{"number":533,"head":"ef5276e8d5b0bcad55bc33f19f7be80b0e0005ec"},"user":"aaron.cork","status":"pending_publish","branch":"cms/digital-project-manager","collection":"job","title":"Digital Project Manager","description":"## About us\n\nWith a 30-year pedigree and a client base to be hugely proud of, RLA is a full-service advertising and marketing communications agency based in a beautiful converted barn in Bournemouth. You’ll have the best of both worlds as you’ll be based in a stunning, relaxed countryside location, but be just a 20-minute drive to Dorset’s finest beaches!\n\n## The Role\n\nAs Project Manager you will project manage the delivery of small to medium digital projects (which may compromise both new projects, change requests and business as usual retainer work.) Projects will include work across websites and internally built software platforms.\n\nYou will:\n\n* Effectively project manage all stages of digital projects in order to achieve client and project deadlines.\n* Schedule, monitor and manage team work to optimise capacity.\n* Manage project variables (time, cost, quality) from brief through to delivery (including post-launch support).\n* Work with and support developers - providing the interface between the development team and the account teams.\n* In collaboration with internal teams, prepare and complete all project documentation, including timing plans.\n* Undertake thorough Quality Assurance testing on projects, to ensure the final delivery meets requirements and scope. \n* Work with creative, strategy, planning & digital teams to deliver a solution that always pushes the client brief ensuring proactivity is at the heart of everything we do.\n* Develop and maintain a strong relationship with the client and account teams, including third party teams.\n* Understand hosting and data protection requirements in order to work in collaboration with the IT Manager to ensure data security and GDPR compliance for digital projects.\n\n\n\n## About You\n\n* Experience in running digital projects.\n* Be comfortable working with technical systems and platforms, including Content Management Systems and digital project management software (eg. JIRA).  \n* Have an understanding of digital and data security standards.\n* Ability to hold challenging conversations to engage others in change and delivery.\n* Demonstrates a real knowledge and passion for digital/ integrated marketing and keeps abreast of latest developments both for business and personal interest.\n* Personal capacity for growth and development. \n* Highly commercial (strong sales drive).\n* A relentless desire for delivering work on budget, on brief and time.\n* A forensic attention to detail and the ability to implement process to maintain quality control across the account/project lifespan.\n* Able to form and maintain relationships at all levels in order to deliver profitable and on time digital projects.\n* A good foundation of Digital knowledge to enable \"selling-up\" of projects.\n* ## \n\nNice to have:\n\n* Experience with React Native\n* Good understanding of Yarn, NPM, Webpack and the whole frontend toolchain\n* Some experience of DevOps","objects":{"entry":{"path":"src/pages/careers/digital-project-manager.md","sha":"549372941f9c6a072e870e9f011bfc3950cc859b"},"files":[]},"timeStamp":"2019-02-05T15:33:23.504Z"}