{"type":"PR","pr":{"number":276,"head":"6a88eb409511e52f322db55f33553072b4a10390"},"user":"chris.rodgers","status":"draft","branch":"cms/front-end-developer-ux","collection":"job","title":"Front End Developer / UX","description":"# About Us\n\nWe’ve got a great new opportunity for a Front End Developer to join our team!\n\nRLA are a hugely successful full service creative agency, with offices in Bournemouth, Belfast and London. From the moment we opened our doors 30 years ago, we’ve been helping an enviable roster of clients achieve their goals; ranging from start-ups to some of the world’s most famous brands! Furthermore, we are part of the Mission group, the fifth largest communications group in the UK.\r\n\nWe look for people who share and can demonstrate our core values; Agile, Astute, Can-Do, Inspiring, Trusted, Together. In return, we can offer you a great place to work in an environment that encourages continuous self-improvement and development. What’s more, you’ll have the best of both worlds as you’ll be based in a beautiful, relaxed countryside location, but be just a 20-minute drive to the beach!\r\n\n\n\n# THE Role\n\nYou will be working as part of a friendly and experienced development team.  We have a number of exciting projects ranging from CMS based sites, to large bespoke sites for multinational companies.  Our clients include many large automotive firms such as BMW, Fiat Group and Volvo, as well as other clients such as Salisbury BID. \r\n\nYour role will mainly be to develop the front end of our web applications; however other responsibilities will include: -\r\n\n* Communicating with our design and accounts teams to inform designs and ensuring they will work as responsive web products.  \r\n* Taking the designs and turning them into working web interfaces.  \r\n* Adding advanced functionality using JavaScript, mainly React based solutions.  \r\n* Helping inform API design by working with the backend development team.\r\n* Consulting and making recommendations on UX for all designs being implemented on any digital product.\r\n* Reviewing & improving the UX across our existing projects.\r\n* Assisting in preparation for pitches, proposals and wireframes to ensure best practice UX.\r\n* Troubleshooting front-end issues across websites & templates.\r\n* \n\n# The Person:\n\n* **Key Skills\r**\n  HTML\r\n  CSS\r\n  JavaScript - ES2015/16, React, Redux, WebPack\r\n  UX\r\n  \r\n  **Good to have\r**\n  Native Application Experience\r\n  Design\r\n  CMS Experience (e.g. WordPress)","objects":{"entry":{"path":"src/pages/careers/front-end-developer-ux.md","sha":"f7087dc7e1882bf6c611d8bbed73d2d112fc9c31"},"files":[]},"timeStamp":"2018-04-27T16:43:09.487Z"}