{"type":"PR","pr":{"number":540,"head":"63eb012be3849cbe88976968c864950e0cbd82a2"},"user":"aaron.cork","status":"draft","branch":"cms/front-end-developer","collection":"job","title":"Full Stack Developer","description":"## About us\n\nWith a 30-year pedigree and a client base to be hugely proud of, RLA is a full-service advertising and marketing communications agency based in a beautiful converted barn in Bournemouth. You’ll have the best of both worlds as you’ll be based in a stunning, relaxed countryside location, but be just a 20-minute drive to Dorset’s finest beaches!\n\n## The Role\n\nWe have many exciting projects including large bespoke websites for multinational companies or brand-new digital products. Our clients are primarily internationally recognised, automotive brands firms and your role will be focused on building next generation web software. As one of our full-stack developers you will be focusing on the architecture and development of our digital products and solutions. Your role will include PHP and React development, on both new and existing projects. The role requires someone who is innovative, a good problem solver and ability to work on own initiative.\n\nYou will:\n\n* Development of web applications and websites from backend to frontend \n* Building reusable code and libraries for future use\n* Optimisation of the applications for maximum speed and scalability\n* Implementation of a robust set of services and APIs to power web applications\n* Integration of the front-end and back-end aspects of web applications\n* Provide accurate estimates for digital projects to support project managers and account teams in new digital project proposals\n* Guidance to creative, planning and account teams in relation to digital projects and solutions\n* Demonstrate commercial awareness through working within project timelines, and effectively communicating and escalating to relevant project manager\n* Ability to translate technical information to non-technical team members, and ensure understanding\n\n## About You\n\n* Previous experience in web development; building interactive and responsive sites\n* Experience working with PHPP5/7 & Laravel \n* Experience working with React.js and Redux\n* Experience with Typescript/ES6\n* Experience with SASS\n* Used to working with API integrations: REST, SOAP, XML, GraphQL, Micro service architecture\n* Agile, Testing, CI/CD\n\n\n\nNice to have:\n\n* Experience with React Native\n* Good understanding of Yarn, NPM, Webpack and the whole frontend toolchain\n* Some experience of DevOps","objects":{"entry":{"path":"src/pages/careers/front-end-developer.md","sha":"fd378d613c4a39416ac85db7b3361e1cb27d6db7"},"files":[]},"timeStamp":"2019-02-05T16:31:50.716Z"}