{"type":"PR","pr":{"number":525,"head":"7ab36ca43dc982650ddd01304166feff2205319c"},"user":"chris.rodgers","status":"draft","branch":"cms/front-end-developer","collection":"job","title":"Front End Developer","description":"## About us\n\nWith a 30-year pedigree and a client base to be hugely proud of, RLA is a full-service advertising and marketing communications agency based in a beautiful converted barn in Bournemouth. You’ll have the best of both worlds as you’ll be based in a stunning, relaxed countryside location, but be just a 20-minute drive to Dorset’s finest beaches!\n\n## The Role\n\nWe have many exciting projects including large bespoke websites for multinational companies or brand new digital products. Our clients are primarily internationally recognised, automotive brands firms and your role will be focused on building next generation web software, using modern frontend technologies and techniques. \n\nYou will:\n* Develop responsive web front-end, ensuring an excellent end user experience. \n* Develop new bespoke digital products.\n* Work designs and wireframes into high quality code.\n* Work closely with client services & creative studio to understand the business. domain and client requirements that drive analysis, architecture/design and development of quality technical solutions.\n* You will consult and make recommendations on UX for all digital product.\n* Troubleshoot front end issues across websites & email templates.\n\n## About You\n* Previous experience in web development; building interactive and responsive sites\n* Previous commercial experience working with React.js and Redux \n* Experience with Typescript/ES6\n* Experience with SASS\n* Good understanding of Yarn, NPM, Webpack and the whole frontend toolchain \n* Experience with version control (Git) \n## \n\nNice to have:\n* Experience working with PHP 5/7 & Laravel\n* Experience with React Native\n* Used to working with API integrations: REST, SOAP, XML, GraphQL, Micro service architecture","objects":{"entry":{"path":"src/pages/careers/front-end-developer.md","sha":"5d45c9bf787e27beb033a94f6490bfd6bf85fa63"},"files":[{"path":"/static/img/developer.jpg","sha":"616825b2e5dd53af0448934632586e63c2649329"}]},"timeStamp":"2018-12-10T15:08:06.104Z"}