{"type":"PR","pr":{"number":562,"head":"0ec1296a1d0c32b37a7cb817eeb3686cd6c64ef5"},"user":"aaron.cork","status":"pending_publish","branch":"cms/junior-digital-project-manager","collection":"job","title":"Junior Digital Project Manager","description":"## About us\n\nWith a 30-year pedigree and a client base to be hugely proud of, RLA is a full-service advertising and marketing communications agency based in a beautiful converted barn in Bournemouth. You’ll have the best of both worlds as you’ll be based in a stunning, relaxed countryside location, but be just a 20-minute drive to Dorset’s finest beaches!\n\n## The Role\n\nWe have many exciting projects including large bespoke websites for multinational companies or brand-new digital products. Our clients are primarily internationally recognised, automotive brands and your role will be focused on supporting the on-going development and running of programmes for our existing clients. As a Junior Project Manager, you will be focusing on ensuring the smooth running of all our digital projects. Your role will include liaising with our client services teams to ensure new work and existing support will be carried out to the time, budget and quality required.\n\nYou will:\n\n* Manage the incoming support requests within our support system.\n* Assign, support and assist development team with support tickets.\n* Liaise with client services on support tickets.\n* Provide reporting to management on the status of the support queue.\n* Be responsible for making sure we adhere to all SLAs or support agreements in place with our clients.\n* Identify inefficiencies in the current process and continually look to improve.\n* Work with and support developers – providing the interface between the development team and the account teams.\n* In collaboration with internal teams, prepare and complete all project documentation, including timing plans.\n* Undertake thorough Quality Assurance testing on projects, to ensure the final delivery meets requirements and scope.\n* Understand hosting and data protection requirements to work in collaboration with the IT Manager to ensure data security and GDPR compliance for digital projects.\n* To develop and maintain a strong relationship with the client and client services teams, including third party teams.\n* Develop a deep working knowledge of the client’s business and sector and use this knowledge to make recommendations and proposals.\n* Accountable for personal administration, ensuring all timesheets are submitted regularly and that the RLA management system details are up to date.\n\n## About You\n\n* Demonstrates a real passion for digital.\n* Personal capacity for growth and development.\n* Excellent communicator.\n* Highly organised.\n* Highly commercial.\n* A relentless desire for delivering work on budget, on brief and on time.\n* A forensic attention to detail and drive to make sure things are delivered right.\n* Able to form and maintain relationships at all levels.\n\nNice to have:\n\n* Experience in running digital projects.\n* Experience working with developers\n* Be comfortable in working with technical systems and platforms including CMS platforms, PM & capacity tools (JIRA/TeamGantt/Trello).\n* A good foundation of Digital knowledge to enable “selling-up” of projects.","objects":{"entry":{"path":"src/pages/careers/junior-digital-project-manager.md","sha":"c059419701de0bfac24d6ba8cbfebdfd7b3ebdcc"},"files":[]},"timeStamp":"2019-03-21T12:04:32.611Z"}