{"type":"PR","pr":{"number":637,"head":"9084e6fb1347aff68797d3e7623cfa59d44b8524"},"user":"aaron.cork","status":"draft","branch":"cms/marketing-automation-specialist","collection":"job","title":"Marketing Automation Specialist","description":"## About us\n\nWith a 30-year pedigree and a client base to be hugely proud of, RLA is a full-service advertising and marketing communications agency based in a beautiful converted barn in Bournemouth. You’ll have the best of both worlds as you’ll be based in a stunning, relaxed countryside location, but be just a 20-minute drive to Dorset’s finest beaches!\n\n## The role\n\nWe’re looking for a Marketing Automation Specialist to join our growing team and take on the responsibility for building, measuring & optimising communication programmes that engage customers, drive both purchases and brand loyalty, and also meet business requirements. You will manage relevant processes from initial brief (from Client Service teams) through to implementation, delivery and reports in accordance with agreed timescales.\n\n## Key responsibilities include:\n\n* Build, test and execute emails, journeys and campaigns using IBM Watson Campaign Automation (Formerly Silverpop)\n* Perform QA process and troubleshoot issues, managing escalations as required.\n* Work closely with the Digital and Strategy Directors to ensure robust processes and best practices are in place [to maintain the integrity of the datasets].\n* Assist in list management (Data List and imports)\n* Monitor program performance and develop necessary reports/reporting structure\n* Manage a well organised and documented testing plan to continually improve campaign performance\n* Track best practices, monitor industry trends, and make recommendations.\n* Using the full functionality of the systems available, testing techniques, collaboration with stakeholders and closed loop processes you will ensure there is continual improvement in digital campaigns to yield strong results.\n\n## What we're looking for...\n\n* Experience in a B2B Marketing function\n* Experience as a practitioner of marketing automation systems: IBM Watson \n* Experience with using HTML code – as used in marketing automation systems.\n* Experience in designing and building emails using data driven dynamic content\n* Proven ability to design and implement strategic plans; outstanding analytical skills;\n* Excellent organisational and communications skills with a strong attention to detail\n* Strong analytical skills and data-driven thinking.\n* Ability to be an enthusiastic team player who can contribute with marketing automation deep-domain knowledge and experience to achieve results.\n* Solid Campaign, data management and reporting experience is a must.\n* Knowledge of Google Analytics Tag Manager, Google Universal Analytics and general web tracking desirable.","objects":{"entry":{"path":"src/pages/careers/marketing-automation-specialist.md","sha":"95620c943b9366783f163e90e2aaf818eb5654fe"},"files":[]},"timeStamp":"2019-05-30T14:41:17.096Z"}