{"type":"PR","pr":{"number":619,"head":"5b2f03c6e1f71786e087e8344f2a5dca80ddf8c5"},"user":"aaron.cork","status":"draft","branch":"cms/marketing-campaign-administrator","collection":"job","title":"Account Manager","description":"## About us\n\nRLA is a Marketing and Communications agency, based in a Barn just outside of Bournemouth, that specialises in changing the behaviour of consumers for automotive brands.\n\n## Overview\n\nDue to growth, we are looking for an Account Manager to run the day to day delivery of predictive marketing across the Volkswagen group of brands (Volkswagen Audi, Skoda, Seat, Volkswagen Commercial vehicles), along with Scania’s brand and aftersales direct Marketing communications.\n\nReporting into the team Account Director we are looking for an Account Manager that is the perfect blend of art and science with 50% of this role being about managing the delivery and smooth running of aftersales marketing with multiple messages across multiple brands and 50% being able to think strategically and creatively about brand communications across the full marketing mix. \n\n## Responsibilities\n\n* Overseeing the management of campaign delivery which involves reviewing data requests, compiling and sending out communications across Text, Email and DM, via automated systems\n* Campaign led; helping set up and create campaigns across Text, Email and DM, testing the campaigns and delivering them to the set audience.\n* Creative led; supporting brand activity, writing creative briefs (with the planner), reviewing creative work, liaising with studio to create on creative resource needed, reviewing and proofing work.\n* Reporting on response rates, feeding back details re gone away/opt out and bounce backs and optimising performance. \n* To have an in-depth knowledge of the Client’s business and the sector in which they operate\n* To think proactively on behalf of the Client and RLA, considering new marketing opportunities\n* Liaise with Printers and 3rd party suppliers, ensuring that accurate Production Estimates and Quotes are obtained and supplied on time to client\n* To work with the creative team to deliver creative that always pushes the client brief ensuring proactivity is at the heart of everything we do and ensuring all work is to quality, time and cost.\n* To work closely with the Account Director and planning in terms of strategy development and implementation\n* To deputise for the Account Director when necessary, both internally and with Clients\n* To develop and maintain a strong relationship with the client and become the ‘go to’ person for all day to day queries and issues.\n* Manage and oversee the day to day administration of all core Client projects and budgets\n* To effectively delegate work to the Account Executive – providing clarity on all briefs/requests and managing them effectively\n* Present (verbally and in writing) the Agency’s proposals and recommendations effectively, logically and concisely\n\n\n\n## Requirements\n\nYou will love getting stuck into the detail, get excited about finding new ways to improve process efficiency and thrive on accurate delivery. You will have the ability to think strategically and creatively and be able to work collaboratively to find the most effective way of delivering a job. Above all we are looking for someone we will enjoy working with, who has a positive can-do attitude, who can be fully trusted and relied upon. \n\nThe ideal candidate is likely to possess the following qualifications / experience:\n\n* A proven track record of running effective integrated projects. \n* Strong digital skills/Automated Comms experience would be amazing.articulate the \n* Demonstrates a real knowledge and passion for integrated marketing and keeps abreast Experienced on working on fast paced accounts and good at managing many different \n* Excellent communicator (at all levels).\n* Good Commercial understanding \n* A relentless desire for delivering work on budget, on brief and on time.\n* A forensic attention to detail and the ability to implement process to maintain quality control across the account.","objects":{"entry":{"path":"src/pages/careers/marketing-campaign-administrator.md","sha":"dd54271d909eade52fe60a345fcbbdcc9d936c4b"},"files":[]},"timeStamp":"2019-04-24T16:00:44.482Z"}