{"type":"PR","pr":{"number":544,"head":"21d3c845fb7183b6ba6f972343166b05689e25b4"},"user":"chris.saganic","status":"pending_publish","branch":"cms/midweight-art-director-designer","collection":"job","title":"Midweight Art Director / Designer","description":"## About us\n\nWith a 30-year pedigree and a client base to be hugely proud of, RLA is a full- service advertising and marketing communications agency based in a beautiful converted barn near Bournemouth. At RLA, you’ll have the best of both worlds being based in a stunning, relaxed countryside location, and just a 20-minute drive to Dorset’s  nest beaches!\n\n## The Role\n\nThe role is a split role, with the ideal candidate being experienced in both conceptual-creative Art Direction skills, while also able to get their hands dirty and craft beautiful Design work.\n\nDay-to-day tasks will involve coming up with advertising, campaign and brand ideas for our (predominantly automotive) clients, working closely with Client Services, Strategy and Digital teams to execute best-practice solutions for clients, alongside being able to bring ideas to life with killer visuals.\n\n**Responsibilities will include:\r**\n\n* Receiving, understanding and progressing creative briefs (solo and in teams)\r\n* Coming up with and communicating concepts and ideas\r\n* Crafting branding and design layout solutions\n* Some copywriting\r\n* Creating presentations and pitches\r\n* Preparing images for digital and social use\r\n* Helping and guiding designers and artworkers\r\n* Providing mentorship and experience to more junior staff\n* Art Directing projects from scamps through to production.\r\n\n## Our Ideal Candidate\n\nWe’re on the lookout for an established creative, with 4-6 years agency experience, raw talent by the metric-tonne, and a portfolio of knock-your-socks- o  creative work. We’re looking for a bit of a ‘unicorn’ – with attention to detail and design craft being able to back up exciting, fresh ideas.\r\n\nYou’ll need to be able to empathise with our clients’ needs, think commercially\rand work within deadlines and budgets, handle multiple briefs at once, and understand and build upon the strategy that underpins creative briefs. Outstanding communication skills are (obviously) a must, and confidence in explaining and presenting your thinking to clients and other members of the studio team is key.\n\n**Get in touch if:**\n\n* You have a portfolio displaying clever thinking and beautifully crafted design\n* You’re a problem solver, with an attention to detail that verges on obsessive\n* You’re able to work independently, but also....\r\n* You’re a ‘people person’ who enjoys collaborating with teams\r\n* You know more about InDesign, Illustrator and Photoshop than even Adobe do\n* You’re super-talented, and super-interested in our industry\r\n* You’re passionate and stay up-to-date on the latest and greatest in design and\radvertising (and have an informed opinion about it)\r\n* You’re a team player, being able to accept and address and give out\rconstructive feedback\r\n* You’re a cool head, even under the pressure of tight deadlines and pitches\r\n* You’re a hands-on person, who will happily muck in wherever the creative and\rstudio teams need help.\n\n**Qualifications / Experience:**\n\n* A degree in a visual design / creative discipline (or equivalent experience)\r\n* At least 4 years’ experience in an agency environment\r\n* A portfolio of work demonstrating creative excellence\n\n**Whats in it for you:**\n\nRLA’s pretty amazing ‘standard’ benefits (28 days’ holiday plus bank holidays, your birthday as a day o , Continuous Professional Development, Eye Care Scheme, Refer A Friend Scheme, Cycle to Work Scheme, Reward & Recognition Scheme)\n\n**PLUS:**\n\n* Beer Fridge Friday\\* (\\*wine, ice coffee and fancy soft drinks also available)\r\n* The opportunity to get your choice of fresh tunes on the Sonos\r\n* The chance to join RLA’s world-beating frisbee and surfing teams\r\n* The chance to be a key part in shaping the agencies output going forward\r\n* The chance to work alongside some seriously talented, friendly creatives","objects":{"entry":{"path":"src/pages/careers/midweight-art-director-designer.md","sha":"3626b1a68bb6996e8aad22fd5cbbeb45dacd98da"},"files":[]},"timeStamp":"2019-02-13T14:49:51.375Z"}