{"type":"PR","pr":{"number":631,"head":"ff366f641c78ca7fc396e72af08cd1b19be7db29"},"user":"aaron.cork","status":"draft","branch":"cms/motion-graphics-designer","collection":"job","title":"Motion Graphics Designer","description":"## About Us\n\nWith a 30-year pedigree and a client base to be hugely proud of, RLA is a full-service advertising and marketing communications agency based in a beautiful converted barn in Bournemouth. You’ll have the best of both worlds as you’ll be based in a stunning, relaxed countryside location, but be just a 20-minute drive to Dorset’s finest beaches!\n\nWe’re looking for a Motion Graphics designer with agency experience to join our growing team. Having established ourselves in this area with our leading automotive clients, we’re looking to expand our offering and grow the team to help deliver more high-quality, effective video content.\n\n## The Role\n\nWe’re on the lookout for someone with bundles of talent, taste and a real passion for motion work. You’ll need to be pragmatic, and empathetic to our client’s needs, and ace at getting into the mind of consumers. You’ll be able to leverage strategy and creativity to produce impactful, emotional, memorable content.\n\nIn close collaboration with the Creative and Studio Team, day-to-day tasks will involve creating awesome, engaging video content from scratch, including conceptual thinking, visual development, production and delivery using Adobe Creative Suite (After-Effects and Premier, with a knowledge of the other apps that feed into these).\n\nThe team you’ll be working alongside are a passionate bunch, and some of Bournemouth’s finest Designers, Art Directors, Writers and Artworkers, all producing work for big-name clients including BMW, Peugeot, Scania and Volvo.\n\n## Responsibilities Include\n\n* Receiving, understanding and progressing creative briefs.\n* The ability to think strategically about Motion Graphics.\n* A keen sense of visual timing, narrative and storytelling.\n* Working with Art Directors to develop creative treatments, styleframes, storyboards and animation.\n* Designing and preparing content for use in various spaces, including social, event stands, presentations and websites.\n\n## About you\n\n* You have a portfolio website or reel displaying beautifully-crafted Motion Graphics content.\n* You have a passion for the Motion Graphics, and a keen interest in pushing forward with the latest developments and technologies (e.g. 3D rendering).\n* You’re a ‘people person’ who enjoys collaborating with teams.\n* You’re able to take on and work with constructive feedback with a positive approach.\n* You have a keen eye for detail, and strong typographic skills.\n* You’re a hands-on person, who will happily muck in where possible when the team needs help.\n* Experience of working within deadlines is a must, and an ability to take on feedback within the team is essential.\n* Some experience in working with Adobe Photoshop / Illustrator is required, and any specialist experience in areas like Cinema 4D, or videography will be of great interest and help you stand out. We’re also open to hybrid Graphic / Motion designers, but the Motion skillset needs to be highly developed.\n\n## The Rewards\n\n* True professional development – we look to support creative skills growth\n* with internal support and coaching, alongside online and in-person training and courses.\n* 28 days’ holiday (plus bank holidays.) After 5 years’ continuous service, an additional 3 days’ holiday to use during that anniversary year\n* Your birthday as a day off\n* Eye Care Scheme\n* Refer A Friend Scheme\n* Cycle to Work Scheme\n* Reward & Recognition Scheme\n* Free parking\n* The chance to join RLA’s world-beating frisbee and surfing teams!\n* Beer\\* Fridge Friday (\\*wine, ice coffee and fancy soft drinks also available).\n* The opportunity to get your choice of fresh tunes on the Sonos.\n* The chance to be a key part in shaping the agencies output going forward.\n* The chance to work alongside some seriously talented, friendly creatives.","objects":{"entry":{"path":"src/pages/careers/motion-graphics-designer.md","sha":"b293acacecd31218cc46003c6e8cbf52c1ea2697"},"files":[]},"timeStamp":"2019-05-14T16:00:43.277Z"}