{"type":"PR","pr":{"number":628,"head":"e281c8c7194d393d6cf1956f838cc9348b7f29a1"},"user":"aaron.cork","status":"draft","branch":"cms/part-time-marketing-customer-services-manager","collection":"job","title":"Part-time Marketing Customer Services Manager","description":"Have you worked in an agency client services or marketing manager role before? Are you looking for a role whereby you can use your marketing experience? This part-time role, (4.5 hours per day, over 5 days per week) offers flexibility for a work/life balance, whilst still working in a fun and fast-paced agency environment.\n\n## About Us\n\nWith a 30-year pedigree and a client base to be hugely proud of, RLA is a full-service advertising and marketing communications agency based in a beautiful converted barn in Bournemouth. You’ll have the best of both worlds as you’ll be based in a stunning, relaxed countryside location, but be just a 20-minute drive to Dorset’s finest beaches!\n\nWe are looking for a Part-time Marketing Customer Services Manager to run the day to day delivery of our customer services helplines and inbox for Peugeot Citroen and support the Account Manager with our predictive marketing programme that drives sales of accessories and service appointments.\n\n## The Role\n\n* Working closely alongside the Account Managers, you will:\n* Manage the customer service helplines, and inboxes and ensuring that all requests are acknowledged and actioned immediately as well as being captured on logs.\n* Manage campaign delivery supporting the Account Manager in approving data, compiling and sending out communications across Text, Email and DM, via automated systems \n* Help set up and create campaigns across Text, Email and DM, testing the campaigns and delivering them to the set audience.\n* Review and proof-read work.\n* Report on response rates and feedback details regarding gone away/opt out and bounce backs.\n* Oversee the fulfilment of prizes and redemptions of the rewards scheme\n* Support the overall Account team in administrative tasks such as setting up job numbers and job bags, proof reading and general matters.\n\n## About you\n\nWe’re looking for someone to work 5 days per week, for 4.5 hours a day. All the necessary training will be given on the systems needed to fulfil these tasks but there are some upfront skills that will be required:\n\n* Good problem-solving skills – being able to spot issues and talk to the relevant people to solve them.\n* Good writing and communication skills - Being able to respond to a query and clearly articulate the problem and solution both within the agency and with the client.\n* Intermediate/Competent Excel skills – Being able to track and interpret multiple lines of information and compile that information into an easy to use format\n* Time and project management – Being able to juggle a number of contacts and tasks simultaneously, prioritising the most urgent and keeping track of what needs to be done that day, ensuring that things are checked off.\n* Attention to detail and accuracy– Making sure that what you do has been checked thoroughly and it’s correct before passing it on. \n\nAbove all we are looking for someone with a positive can-do attitude, who is committed to delivering a great job. You will love getting stuck into the detail and get excited about finding new ways to improve process efficiency and accurate delivery. You will also be someone who can be fully trusted and relied upon.\n\n## The Rewards\n\n* True professional development – we look to support creative skills growth with internal support and coaching, alongside online and in-person training and courses.\n* 28 days’ holiday (plus bank holidays.) After 5 years’ continuous service, an additional 3 days’ holiday to use during that anniversary year\n* Your birthday as a day off\n* Eye Care Scheme\n* Refer A Friend Scheme\n* Cycle to Work Scheme\n* Reward & Recognition Scheme\n* Fridge Friday\n* Free parking\n* The chance to join RLA’s world-beating frisbee and surfing teams!","objects":{"entry":{"path":"src/pages/careers/part-time-marketing-customer-services-manager.md","sha":"a344d26b4046c19459ab4216569d075de1ff087b"},"files":[]},"timeStamp":"2019-05-14T15:51:56.623Z"}