{"type":"PR","pr":{"number":303,"head":"f9ff4e963c31bb9dd6e3770b0fc7be533cdf4ca0"},"user":"chris.rodgers","status":"draft","branch":"cms/we-re-looking-for-an-account-br-manager-to-join-our-client-services-team","collection":"job","title":"Are you our next Senior Account Manager?","description":"# About Us\n\nWe've got an exciting opportunity for a Senior Account Manager to join our team!\n\nRLA are a hugely successful full-service advertising and marketing communications agency and we pride ourselves in being insightful, original thinkers with very high standards. We've been in business for over 20 years and have offices in both Bournemouth and Belfast. Furthermore, we are part of the Mission group, the fifth largest communications group in the UK.\n\nYou'll have the best of both worlds as you'll be based in a beautiful, relaxed countryside location, but be just a 20-minute drive to the beach!\n\n# THE Role\n\nThe key purpose of this role is to be responsible for the day to day management of one of our biggest accounts.\n\nOther responsibilities will include:\n\n\n\n\n\n* To have an in-depth knowledge of the Client's business and the sector in which they operate\n* To ensure the perfect delivery of all client needs across accounts.\n* To manage a senior account executive/junior AM's personal development and performance and ensure that their work is accurate and on time\n* To think proactively on behalf of the Client and RLA, considering new marketing opportunities\n* To very closely monitor, manage and optimise budgets.\n* Responsible for liaising with Printers and 3rd party suppliers and ensuring that accurate Production Estimates and Quotes are obtained and supplied on time to client\n* To work with the creative team to deliver creative that always pushes the client brief ensuring proactivity is at the heart of everything we do and ensuring all work is to quality, time and cost.\n* To work with the Digital Team and ensure that web site and data bases are accurate and up to date and to become familiar with WATSON the email tool that we use to help and support the AE\n* To work closely with the AD and planning in terms of strategy development and implementation\n* To deputise for the Account Director when necessary, both internally and with Clients\n* To develop and maintain a strong relationship with the client and become the 'go to' person for all day to day queries and issues.\n* To be viewed by the clients as critical to the success of their business.\n* Accountable for personal administration, ensuring all timesheets are submitted regularly\n* Finance and Forecasting. To be aware of performance against monthly targets, what is being invoiced and when\n\n# The Person:\n\n* A proven track record of running effective integrated projects.\n* Experience of managing and developing team members.\n* Demonstrates a real knowledge and passion for integrated marketing and keeps abreast of latest developments both for business and personal interest.\n* Has CRM and automotive skills (ideally)\n* Personal capacity for growth and development.\n* Excellent communicator (at all levels).\n* Good Commercial understanding\n* A relentless desire for delivering work on budget, on brief and on time.\n* A forensic attention to detail and the ability to implement process to maintain quality control across the account.\n* Able to form and maintain relationships at all levels.","objects":{"entry":{"path":"src/pages/careers/we-re-looking-for-an-account-br-manager-to-join-our-client-services-team.md","sha":"033257c157fa9268f455860eccde8257c80862ba"},"files":[]},"timeStamp":"2018-05-01T09:11:13.078Z"}