{"type":"PR","pr":{"number":181,"head":"e85c66a5eabf024847c43efe56c82ce2e4805281"},"user":"chris.rodgers","status":"draft","branch":"cms/we-re-looking-for-a-senior-designer-to-join-our-creative-team-in-belfast","collection":"job","title":"We're looking for a Senior Designer to join our Creative team in Belfast.","description":"# ABOUT US\n\nWe've got an exciting opportunity for a Senior Designer to join our team!\n\nRLA are a hugely successful full service creative agency, with offices in Belfast and Bournemouth. From the moment we opened our doors 30 years ago, we've been helping an enviable roster of clients achieve their goals; ranging from start-ups to some of the world's most famous brands! Furthermore, we are part of the Mission group, the fifth largest communications group in the UK.\n\nWe're looking for a black belt Senior Designer / Creative to join our award-winning team in Belfast!\n\nThis is the perfect opportunity for anyone with the skills to work on a diverse range of projects and mediums from Branding and Packaging to Advertising, Brochures and Websites.\n\n# THE PERSON\n\nYou will have an excellent portfolio of creative work showcasing various skills including the highest levels of design, branding, typography, typesetting and strategic thinking. As well as having superb Mac skills in Adobe InDesign, Illustrator and Photoshop. You will be currently working and delivering in a fast-paced agency with tight deadlines.\n\nYou will be passionate about everything to do with Advertising and Design, as well as having excellent communication skills and experience of working with clients directly as well leading on design briefs, pitches and art directing photoshoots.\n\nDigital design experience would be an added feather in your cap and very much desirable but not essential. Your attention to detail will be second to none.\n\n# TO APPLY\n\nIf this sounds like you, please send your CV and your portfolio to [careers@rla.co.uk](careers@rla.co.uk) by Friday 20th April.","objects":{"entry":{"path":"src/pages/careers/we-re-looking-for-a-senior-designer-to-join-our-creative-team-in-belfast.md","sha":"74fac1cf0d6cd734f47ecc29773a901ef64e574f"},"files":[]},"timeStamp":"2018-04-18T10:05:45.610Z"}