{"type":"PR","pr":{"number":304,"head":"a4edac1be528f2aa3542b632757b2c761437191b"},"user":"chris.rodgers","status":"draft","branch":"cms/we-re-looking-for-a-senior-developer-to-help-in-our-digital-department","collection":"job","title":"We're looking for an Account Manager to join our Client Services team.","description":"# ABOUT US\n\nWe've got an exciting opportunity for an Account Manager to join our team!\n\nRLA are a hugely successful full-service advertising and marketing communications agency and we pride ourselves in being insightful, original thinkers with very high standards. We've been in business for over 20 years and have offices in both Bournemouth and Belfast. Furthermore, we are part of the Mission group, the fifth largest communications group in the UK.\n\nYou'll have the best of both worlds as you'll be based in a beautiful, relaxed countryside location, but be just a 20-minute drive to the beach!\n\n# THE ROLE\n\nThe key purpose of this role is to be responsible for the day to day management of client accounts.\n\nOther responsibilities will include:\n\n* Building and maintaining strong Client relationships and to be the first point of contact for the Client on day to day matters\n* Making steps to build relationships beyond the core Client contacts (for future opportunities)\n* Responsibility for providing team support across the business to ensure that we meet our deliverables\n* Presenting (verbally and in writing) the Agency's proposals and recommendations effectively, logically and concisely\n* Thinking proactively on behalf of the Client and RLA, considering new marketing initiatives\n* Negotiating and gaining approval from the Client for all projects and creative work and to ensure that work is carried out to these agreements\n* Responsibility for the day to day management and development of direct reports\n* Responsibility for day to day budget management, monitoring all job costs, and obtaining approval before spend is committed\n* Identifying opportunities across the group to sell initiatives and projects to the client\n* Negotiating all in costs to get the best possible rates\n  Accountable for trafficking digital requests, website updates, bug fixes and development projects through the digital department\n* On completion of each job ensure a case study including details of the client brief, our solution and the results is written up\n\n\n# THE PERSON\n\n* Personal capacity for growth and development\n* Resource Management Experience\n* Ability to Travel in the UK\n* Understanding of the basic elements of advertising and marketing\n* Excellent organisational skills\n* Creative flair and keen eye for detail\n* Understanding of digital projects and processes\n* Self-motivated\n* Ability to work flexibly, on own initiative and as part of a team\n* First class ability to prioritise and manage own workload\n* Experience of agency processes and systems\n* Ability to build strong client relationships","objects":{"entry":{"path":"src/pages/careers/we-re-looking-for-a-senior-developer-to-help-in-our-digital-department.md","sha":"e7f0888356a42ec6301e0bf74d08b988aaaa3bc8"},"files":[]},"timeStamp":"2018-05-01T09:13:09.905Z"}